Revit 2027 API
BuiltInFailures.ElectricalFailures.SmallBendRadius Property
 The value you entered for the bend radius for conduit is too small. Enter a larger value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SmallBendRadius { get; }
Public Shared ReadOnly Property SmallBendRadius As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SmallBendRadius {
	FailureDefinitionId^ get ();
}
static member SmallBendRadius : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace